//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.

/**
  26. Реализовать визуализацию пирамидальной сортировки.
 Для визуализации необходимо построить в виде двоичного дерева пирамиду (кучу),
 модифицировать эту пирамиду в соответствии с алгоритмом пирамидальной сортировки
 и визуализировать в виде дерева (воспользуйтесь готовой функцией отрисовки).
 */

public class Main {
    public static void main(String[] args) {
        System.out.println("Визуалиция пирамидальной сортировки (Heap sort)");
    }
}